cases/compressible/omega_same/interpolatingSolidBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

domain
{
    xMin -10;
    xMax  15;
    zMin -5;
    zMax  5;

    // numero di celle
    zCells  35;                // dalla patch del profilo alla patch esterna
    xUCells 9;                 // blocchi upstream in direzione streamwise
    xMCells 7;                 // blocchi middle in direzione streamwise
    xDCells 35;                // blocchi downstream in direzione streamwise

    // grading
    zGrading    50;  // dalla patch del profilo alla patch esterna
    xUGrading   5;              // circonferenziale su patch esterne dei blocchi upstream
    leadGrading 0.1;            // circonferenziale su patch profilo dei blocchi upstream
    xDGrading   10;             // downstream
}

aerofoil
{
    xLead   0;
    zLead   0;
    xTrail  1;
    zTrail  0;
    xUpper  0.3;
    zUpper  0.075;
    xLower  0.3;
    zLower -0.075;
}

geometry
{
    aerofoil
    {
        type   triSurfaceMesh;
        file   "NACA0015.obj";
    }
    cylinder
    {
        type   searchableCylinder;
        point1 ($:aerofoil.xUpper -1e3 0);
        point2 ($:aerofoil.xUpper  1e3 0);
        radius $:domain.zMax;
    }
}

vertices
(
    project ($aerofoil.xLower -0.1 $domain.zMin) (cylinder)
    ($aerofoil.xTrail -0.1 $domain.zMin)
    ($domain.xMax -0.1 $domain.zMin)

    project ($domain.xMin     -0.1 $aerofoil.zLead) (cylinder)
    project ($aerofoil.xLead  -0.1 $aerofoil.zLead) (aerofoil)
    project ($aerofoil.xTrail -0.1 $aerofoil.zTrail) (aerofoil)
    ($domain.xMax -0.1 $aerofoil.zTrail)

    project ($aerofoil.xLower -0.1 $aerofoil.zLower) (aerofoil)
    project ($aerofoil.xUpper -0.1 $aerofoil.zUpper) (aerofoil)

    project ($aerofoil.xUpper -0.1 $domain.zMax) (cylinder)
    ($aerofoil.xTrail -0.1 $domain.zMax)
    ($domain.xMax -0.1 $domain.zMax)

    project ($aerofoil.xLower  0.1 $domain.zMin) (cylinder)
    ($aerofoil.xTrail  0.1 $domain.zMin)
    ($domain.xMax 0.1 $domain.zMin)

    project ($domain.xMin      0.1 $aerofoil.zLead) (cylinder)
    project ($aerofoil.xLead   0.1 $aerofoil.zLead) (aerofoil)
    project ($aerofoil.xTrail  0.1 $aerofoil.zTrail) (aerofoil)
    ($domain.xMax 0.1 $aerofoil.zTrail)

    project ($aerofoil.xLower  0.1 $aerofoil.zLower) (aerofoil)
    project ($aerofoil.xUpper  0.1 $aerofoil.zUpper) (aerofoil)

    project ($aerofoil.xUpper  0.1 $domain.zMax) (cylinder)
    ($aerofoil.xTrail  0.1 $domain.zMax)
    ($domain.xMax 0.1 $domain.zMax)
);

blocks
(
    hex ( 7 4 16 19 0 3 15 12)
    ($:domain.xUCells 1 $:domain.zCells)
    edgeGrading
    (
        $:domain.leadGrading $:domain.leadGrading $:domain.xUGrading $:domain.xUGrading
        1 1 1 1
        $:domain.zGrading $:domain.zGrading $:domain.zGrading $:domain.zGrading
    )

    hex ( 5 7 19 17 1 0 12 13)
    ($:domain.xMCells 1 $:domain.zCells)
    simpleGrading (1 1 $:domain.zGrading)

    hex ( 17 18 6 5 13 14 2 1)
    ($:domain.xDCells 1 $:domain.zCells)
    simpleGrading ($:domain.xDGrading 1 $:domain.zGrading)

    hex ( 20 16 4 8 21 15 3 9)
    ($:domain.xUCells 1 $:domain.zCells)
    edgeGrading
    (
        $:domain.leadGrading $:domain.leadGrading $:domain.xUGrading $:domain.xUGrading
        1 1 1 1
        $:domain.zGrading $:domain.zGrading $:domain.zGrading $:domain.zGrading
    )

    hex ( 17 20 8 5 22 21 9 10)
    ($:domain.xMCells 1 $:domain.zCells)
    simpleGrading (1 1 $:domain.zGrading)

    hex ( 5 6 18 17 10 11 23 22)
    ($:domain.xDCells 1 $:domain.zCells)
    simpleGrading ($:domain.xDGrading 1 $:domain.zGrading)
);

edges
(

    project 4 7 (aerofoil)
    project 7 5 (aerofoil)
    project 4 8 (aerofoil)
    project 8 5 (aerofoil)

    project 16 19 (aerofoil)
    project 19 17 (aerofoil)
    project 16 20 (aerofoil)
    project 20 17 (aerofoil)

    project 3 0 (cylinder)
    project 3 9 (cylinder)
    project 15 12 (cylinder)
    project 15 21 (cylinder)
);

boundary
(
    aerofoil
    {
        type wall;
        faces
        (
            (4 7 19 16)
            (7 5 17 19)
            (5 8 20 17)
            (8 4 16 20)
        );
    }

    inlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (0 3 15 12)
            (0 12 13 1)
            (1 13 14 2)
            (10 11 23 22)
            (9 10 22 21)
            (3 9 21 15)
        );
    }

    outlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (2 14 18 6)
            (6 18 23 11)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 3 0 7)
            (5 7 0 1)
            (6 5 1 2)
            (3 4 8 9)
            (8 5 10 9)
            (5 6 11 10)
        );
    }

    front
    {
        type empty;
        faces
        (
            (15 16 19 12)
            (19 17 13 12)
            (17 18 14 13)
            (15 16 20 21)
            (20 17 22 21)
            (17 18 23 22)
        );
    }
);

// ************************************************************************* //
