cases/compressible/omega_same/interpolatingSolidBody/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       7038;
    }
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          102;
        startFace       7070;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          70;
        startFace       7172;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3570;
        startFace       7242;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3570;
        startFace       10812;
    }
)

// ************************************************************************* //
