cases/compressible/omega_same/interpolatingSolidBody/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pRef;

boundaryField
{
    aerofoil
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $pRef;
    }
    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             psi;
        gamma           $gamma;
        fieldInf        $pRef;
        lInf            10;         // ~10 chords relaxation length
        value           uniform $pRef;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
