cases/compressible/omega_same/interpolatingSolidBody/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
7344
(
1
1
0.9999999966
0.9999998745
0.9999793775
0.9999732852
0.9999083587
0.9998882772
...
)
;

boundaryField
{
    aerofoil
    {
        type            calculated;
    }
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
